---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.DPartReinfDeletedEditDivision
source: html/65beb5e8-3602-4ea7-2cc0-01504211a412.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.DPartReinfDeletedEditDivision Property

Edits to the model will cause some Reinforcement hosted on Parts to be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId DPartReinfDeletedEditDivision { get; }
```